---
title: "SQLite in Python"
format: 
    revealjs:
        slide-number: true
        theme: dark
        highlight-style: "vim-dark"
        incremental: true
        footer: "Manish Patel"
        progress: true
        spotlight:
            size: 35
    
revealjs-plugins:
  - spotlight
jupyter: python3
execute:
  echo: true
---


## Transaction (Begin, Commit, Rollback) {.smaller}

Generally the SQLite is in auto-commit mode. 

- BEGIN – start the transaction;
- COMMIT – commit the transaction that means all the changes saved to database;
- ROLLBACK – rollback the complete transaction.

Transactional control commands are only used with commands INSERT, UPDATE, and DELETE. They cannot be used while creating tables or dropping them because these operations are automatically committed in the database.


The ***DELETE*** is a very dangerous command so it is better to firstly back up your database before applying it.

## IMPORT SQLITE3

In [1]:
import sqlite3 as lite
import sys

## 1. Connect to database

In [2]:
con = lite.connect('demo.db3')

## CREATE TABLE

In [3]:
with con:
    cur = con.cursor() 
    
    sql = """
    DROP TABLE  IF EXISTS watershed_yearly_bk;
    CREATE TABLE watershed_yearly_bk AS SELECT YR, PREC_mm FROM watershed_yearly
    """
    
    cur.executescript(sql)

## UPDATE TABLE

In [4]:
with con:
    cur = con.cursor()
    sql = """
    UPDATE watershed_yearly_bk
    SET PREC_mm = NULL
    WHERE
    PREC_mm < 850.0
    """    
    cur.executescript(sql)

## RETRIEVE TABLE {.smaller}

In [5]:
with con:      
    cur = con.cursor()    
    cur.execute("SELECT * FROM watershed_yearly_bk")

    rows = cur.fetchall()

    for row in rows:
        print(row)

(1981, 895.6051025390625)
(1982, 884.670654296875)
(1983, None)
(1984, 867.5743408203125)
(1985, None)
(1986, None)
(1987, 1007.8944702148438)
(1988, 895.8466186523438)
(1989, 930.10546875)
(1990, None)
(1991, 984.4703369140625)
(1992, 907.9463500976562)
(1993, 1057.7733154296875)
(1994, None)
(1995, None)
(1996, None)
(1997, None)
(1998, None)
(1999, None)
(2000, None)
(2001, None)
(2002, None)
(2003, None)
(2004, None)
(2005, 855.0092163085938)
(2006, None)
(2007, None)
(2008, None)
(2009, 1040.9012451171875)
(2010, 905.66845703125)

## ROLLBACK a  DELETE transaction

In [6]:
con.isolation_level = None
cur = con.cursor()
cur.execute("BEGIN")
sql = """
      DELETE FROM watershed_yearly_bk WHERE PREC_mm IS NULL
      """
cur = con.execute(sql)
cur.execute("ROLLBACK")

## FINAL VIEW {.smaller}

In [7]:
cur = con.cursor()    
cur.execute("SELECT * FROM watershed_yearly_bk")

rows = cur.fetchall()

for row in rows:
    print(row)

(1981, 895.6051025390625)
(1982, 884.670654296875)
(1983, None)
(1984, 867.5743408203125)
(1985, None)
(1986, None)
(1987, 1007.8944702148438)
(1988, 895.8466186523438)
(1989, 930.10546875)
(1990, None)
(1991, 984.4703369140625)
(1992, 907.9463500976562)
(1993, 1057.7733154296875)
(1994, None)
(1995, None)
(1996, None)
(1997, None)
(1998, None)
(1999, None)
(2000, None)
(2001, None)
(2002, None)
(2003, None)
(2004, None)
(2005, 855.0092163085938)
(2006, None)
(2007, None)
(2008, None)
(2009, 1040.9012451171875)
(2010, 905.66845703125)

## COMMIT a DELETE transaction

In [8]:
cur = con.cursor()
cur.execute("BEGIN")
sql = """
      DELETE FROM watershed_yearly_bk WHERE PREC_mm IS NULL
      """
cur = con.execute(sql)
cur.execute("COMMIT")

## SELECT TABLE

In [9]:
cur = con.cursor()    
cur.execute("SELECT * FROM watershed_yearly_bk")

rows = cur.fetchall()

for row in rows:
    print(row)

(1981, 895.6051025390625)
(1982, 884.670654296875)
(1984, 867.5743408203125)
(1987, 1007.8944702148438)
(1988, 895.8466186523438)
(1989, 930.10546875)
(1991, 984.4703369140625)
(1992, 907.9463500976562)
(1993, 1057.7733154296875)
(2005, 855.0092163085938)
(2009, 1040.9012451171875)
(2010, 905.66845703125)

## Close the db connection

In [10]:
con.close()

## Load SQL

In [1]:
%load_ext sql

## Create a table
- `%%sql` let you use multiple SQL statements inside a single cell. 
- It is now time to create one using a standard SQL command – `CREATE TABLE`. 
- If the table already existed in the database, an error will pop up. 
- In addition, we set ***PRIMARY KEY*** on USERID to prevent from inserting duplicate writers into the table.

## Table Creation

In [2]:
#| code-line-numbers: "1|2|3-8"
#| echo: true
#| output-location: fragment
#| auto-animate: true

%%sql sqlite://
CREATE TABLE writer(
    FirstName VARCHAR(50) NOT NULL,
    LastName VARCHAR(50) NOT NULL,  
    USERID int  NOT NULL UNIQUE, 
    PRIMARY KEY (USERID)
);

Done.

[]

## Add data to the table

The table we have just created is empty. Now we insert some sample data inside it. To populate this data in the form of rows, we use the command INSERT.

## Insert into table

In [3]:
#| code-line-numbers: "1,2"
#| echo: true
#| output-location: fragment
%%sql sqlite://
INSERT INTO writer VALUES ('William', 'Shakespeare', 1616);
INSERT INTO writer VALUES ('Lin', 'Han', 1996);
INSERT INTO writer VALUES ('Peter', 'Brecht', 1978);

1 rows affected.
1 rows affected.
1 rows affected.

[]

## Write the First Query

- Let us now turn our attention to writing a simple query to check the results of our previous operations in which we created a table and inserted three rows of data into it. For this, we would use the command called SELECT.

- We can put the query result into a variable such as the following sqlres.

## Write Query

In [4]:
#| code-line-numbers: "1|2"
#| echo: true
#| output-location: fragment
#| auto-animate: true

sqlres = %sql SELECT * from writer
sqlres

 * sqlite://
Done.

[('William', 'Shakespeare', 1616),
 ('Lin', 'Han', 1996),
 ('Peter', 'Brecht', 1978)]

## Select FirstName, LastName

In [5]:
#| code-line-numbers: "1|2"
#| echo: true
#| output-location: fragment
#| auto-animate: true
sqlres = %sql SELECT FirstName, LastName from writer
sqlres

 * sqlite://
Done.

[('William', 'Shakespeare'), ('Lin', 'Han'), ('Peter', 'Brecht')]

## List  tables in a database

- Table and index names can be list by doing a **SELECT** on a special table named "***SQLITE_MASTER***". 
- Every SQLite database has an SQLITE_MASTER table that defines the schema for the database. For tables, the ***type*** field will always be '***table***' and the name field will be the name of the table. 
- So to get a list of all tables in the database, use the following SELECT command:

##

## LOAD DATABASE

In [6]:
%sql sqlite:///demo.db3

## {.smaller}

In [7]:
#| code-line-numbers: "1"
#| echo: true
#| output-location: slide
#| auto-animate: true

%sql SELECT name FROM sqlite_master WHERE type='table'

   sqlite://
 * sqlite:///demo.db3
Done.

[('rch',),
 ('hru',),
 ('sub',),
 ('sed',),
 ('watershed_daily',),
 ('watershed_monthly',),
 ('watershed_yearly',),
 ('channel_dimension',),
 ('hru_info',),
 ('sub_info',),
 ('rch_info',),
 ('ave_plant',),
 ('ave_annual_hru',),
 ('ave_monthly_basin',),
 ('ave_annual_basin',),
 ('sqlite_sequence',),
 ('watershed_yearly_bk',),
 ('Temperature',)]

## Select rch

In [9]:
%sql select * from rch LIMIT 0

   sqlite://
 * sqlite:///demo.db3
Done.

[]

## Retrieving Data with SELECT {.smaller}

- When working with databases and SQL, the most common task is to request data from one or more tables, which returns this data in the form of a result table. 
- These result tables are called result-sets. 
- In most applications, ***SELECT*** is the most commonly used data query language (DQL) command. Moreover, the ***SELECT*** can do far more than simply retrieve and display data and I will show you in the following sections. `SELECT column1, column2, columnN FROM table_name;`
- Here, `column1, column2`... are the fields (or columns) of a table (table_name).

- However, if you want query all records, just use: `SELECT * FROM table_name;`

## SELECT

In [135]:
%sql SELECT * From watershed_yearly LIMIT 5

   sqlite://
 * sqlite:///demo.db3
Done.

[(1981, 895.6051025390625, 130.3574676513672, 51.33439254760742, 406.0739440917969, 443.198486328125, 0.0, 18819.70703125, 236.98300170898438, 840.6874389648438, 609.706787109375, 91.08026123046875, 0.03293686360120773, 0.06417319178581238, 5.615890026092529, 7.339915752410889, 11.857464790344238, 0.008220621384680271, 1.461671233177185, 0.0),
 (1982, 884.670654296875, 92.21265411376953, 50.34769058227539, 367.41070556640625, 424.6783752441406, 0.0, 19425.8359375, 256.79083251953125, 872.07470703125, 530.0245971679688, 64.80978393554688, 0.00797836109995842, 0.04918050765991211, 4.239809036254883, 7.676506042480469, 10.873835563659668, 0.007697358727455139, 1.343782901763916, 0.0),
 (1983, 816.6605224609375, 129.16310119628906, 54.47308349609375, 445.33306884765625, 462.76324462890625, 0.0, 18476.1953125, 237.70555114746094, 797.04736328125, 652.8157958984375, 92.04792785644531, 0.13790887594223022, 0.048595353960990906, 3.882063388824463, 7.301627159118652, 12.202207565307617, 0.015354366973042488, 1.5196093320846558, 0.0),
 (1984, 867.5743408203125, 95.57946014404297, 46.948646545410156, 347.2448425292969, 408.5397033691406, 0.0, 17727.712890625, 223.08975219726562, 911.25634765625, 510.37933349609375, 63.0908203125, 0.01470834668725729, 0.0440557599067688, 5.141480922698975, 6.492110729217529, 10.941608428955078, 0.011575199663639069, 1.3742408752441406, 0.0),
 (1985, 637.7255249023438, 75.55760192871094, 45.336883544921875, 358.2953186035156, 361.4852294921875, 0.0, 15840.5400390625, 236.32135009765625, 990.8557739257812, 499.33990478515625, 49.63069152832031, 0.05470645800232887, 0.046555422246456146, 3.113034963607788, 6.522554874420166, 8.959033966064453, 0.010798747651278973, 1.1150814294815063, 0.0)]

## SELECT CUSTOM COLUMNS {.smaller}

In [128]:
%sql SELECT YR, PREC_mm, PET_mm From watershed_yearly LIMIT 5

   sqlite://
 * sqlite:///demo.db3
Done.

[(1981, 895.6051025390625, 840.6874389648438),
 (1982, 884.670654296875, 872.07470703125),
 (1983, 816.6605224609375, 797.04736328125),
 (1984, 867.5743408203125, 911.25634765625),
 (1985, 637.7255249023438, 990.8557739257812)]

## SELECT CUSTOM COLUMNS {.smaller}

In [129]:
%sql SELECT YR, PREC_mm, PET_mm, PET_mm-PREC_mm From watershed_yearly LIMIT 5

   sqlite://
 * sqlite:///demo.db3
Done.

[(1981, 895.6051025390625, 840.6874389648438, -54.91766357421875),
 (1982, 884.670654296875, 872.07470703125, -12.595947265625),
 (1983, 816.6605224609375, 797.04736328125, -19.6131591796875),
 (1984, 867.5743408203125, 911.25634765625, 43.6820068359375),
 (1985, 637.7255249023438, 990.8557739257812, 353.1302490234375)]

## CREATE ALIASES

In [130]:
%sql SELECT YR, PREC_mm, PET_mm, PET_mm-PREC_mm as PED_mm From watershed_yearly LIMIT 5

   sqlite://
 * sqlite:///demo.db3
Done.

[(1981, 895.6051025390625, 840.6874389648438, -54.91766357421875),
 (1982, 884.670654296875, 872.07470703125, -12.595947265625),
 (1983, 816.6605224609375, 797.04736328125, -19.6131591796875),
 (1984, 867.5743408203125, 911.25634765625, 43.6820068359375),
 (1985, 637.7255249023438, 990.8557739257812, 353.1302490234375)]

## ROW CONTRAINTS Returned by a SELECT Query {.smaller}

- Often it is not convenient to show all rows on screen as you have to scroll. 
- We can use use SQLite ***LIMIT*** clause to constrain the number of rows returned by a query. 
- This can be used for testing or to prevent consuming excessive resources if the query returns more information than expected.

- The following illustrates the syntax of the LIMIT clause: `SELECT column_list FROM table_name LIMIT row_count;`

## LIMIT {.smaller}

In [14]:
%sql SELECT * From watershed_yearly LIMIT 10

   sqlite://
 * sqlite:///demo.db3
Done.

[(1981, 895.6051025390625, 130.3574676513672, 51.33439254760742, 406.0739440917969, 443.198486328125, 0.0, 18819.70703125, 236.98300170898438, 840.6874389648438, 609.706787109375, 91.08026123046875, 0.03293686360120773, 0.06417319178581238, 5.615890026092529, 7.339915752410889, 11.857464790344238, 0.008220621384680271, 1.461671233177185, 0.0),
 (1982, 884.670654296875, 92.21265411376953, 50.34769058227539, 367.41070556640625, 424.6783752441406, 0.0, 19425.8359375, 256.79083251953125, 872.07470703125, 530.0245971679688, 64.80978393554688, 0.00797836109995842, 0.04918050765991211, 4.239809036254883, 7.676506042480469, 10.873835563659668, 0.007697358727455139, 1.343782901763916, 0.0),
 (1983, 816.6605224609375, 129.16310119628906, 54.47308349609375, 445.33306884765625, 462.76324462890625, 0.0, 18476.1953125, 237.70555114746094, 797.04736328125, 652.8157958984375, 92.04792785644531, 0.13790887594223022, 0.048595353960990906, 3.882063388824463, 7.301627159118652, 12.202207565307617, 0.015354366973042488, 1.5196093320846558, 0.0),
 (1984, 867.5743408203125, 95.57946014404297, 46.948646545410156, 347.2448425292969, 408.5397033691406, 0.0, 17727.712890625, 223.08975219726562, 911.25634765625, 510.37933349609375, 63.0908203125, 0.01470834668725729, 0.0440557599067688, 5.141480922698975, 6.492110729217529, 10.941608428955078, 0.011575199663639069, 1.3742408752441406, 0.0),
 (1985, 637.7255249023438, 75.55760192871094, 45.336883544921875, 358.2953186035156, 361.4852294921875, 0.0, 15840.5400390625, 236.32135009765625, 990.8557739257812, 499.33990478515625, 49.63069152832031, 0.05470645800232887, 0.046555422246456146, 3.113034963607788, 6.522554874420166, 8.959033966064453, 0.010798747651278973, 1.1150814294815063, 0.0),
 (1986, 733.8412475585938, 65.63016510009766, 36.76259231567383, 241.9388427734375, 281.6683349609375, 0.0, 16059.4345703125, 243.0305633544922, 977.513427734375, 358.09368896484375, 48.7893180847168, 0.0010510582942515612, 0.040558818727731705, 2.8865158557891846, 6.505890369415283, 7.870068073272705, 0.013286528177559376, 0.970182478427887, 0.0),
 (1987, 1007.8944702148438, 110.28632354736328, 62.23741912841797, 445.5394592285156, 493.0043029785156, 0.0, 19541.869140625, 256.9570007324219, 841.0055541992188, 641.2118530273438, 76.02854919433594, 0.013590915128588676, 0.05216805264353752, 3.6147713661193848, 5.987320899963379, 14.57848834991455, 0.019578929990530014, 1.8156678676605225, 0.0),
 (1988, 895.8466186523438, 149.65235900878906, 61.493255615234375, 450.4956970214844, 493.1164245605469, 0.0, 17205.849609375, 220.8395233154297, 891.13330078125, 686.12744140625, 101.2978744506836, 0.025784092023968697, 0.04415411874651909, 3.241307258605957, 5.892490386962891, 13.989458084106445, 0.030675839632749557, 1.7415385246276855, 0.0),
 (1989, 930.10546875, 111.37128448486328, 57.6666145324707, 418.1727600097656, 474.9247741699219, 0.0, 17915.3359375, 208.58026123046875, 805.931884765625, 609.6959838867188, 74.79584503173828, 0.016387958079576492, 0.04736720025539398, 3.692014217376709, 5.3133368492126465, 10.229286193847656, 0.025520162656903267, 1.2660586833953857, 0.0),
 (1990, 751.4553833007812, 102.00208282470703, 54.310569763183594, 409.75189208984375, 435.1587829589844, 0.0, 16842.517578125, 213.63233947753906, 966.4890747070312, 589.3450317382812, 73.0428695678711, 0.007093863561749458, 0.04154253378510475, 3.0770206451416016, 5.872688293457031, 9.7684326171875, 0.025202790275216103, 1.2055107355117798, 0.0)]

## Filtering a Query with WHERE

Sometimes, you’ll want to only check the rows returned by a query, where one or more columns meet certain criteria. This can be done with a WHERE statement. The WHERE clause is an optional clause of the SELECT statement. It appears after the FROM clause as the following statement:
>SELECT column_list FROM table_name WHERE search_condition;

## Example {.smaller}

In [15]:
%sql SELECT * From rch LIMIT 5

   sqlite://
 * sqlite:///demo.db3
Done.

[(1, 1981, 1, 146.34376525878906, 146.2524871826172, 0.09128088504076004, 0.0, 2.3320461650655488e-07, 61619.46484375, 155.3719024658203, 0.016086287796497345, 0.0, 0.04825887829065323, 0.0, 362.0486755371094, 361.8135070800781, 203.620849609375, 421.18377685546875, 0.0, 23.0184326171875, 0.016107244417071342, 0.0, 1.1839052307949238e-11, 0.0, 0.0, 0.0, 5627225.0, 5623486.5, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 806.0157470703125, 0.0, 0.0, 0.0),
 (2, 1981, 1, 96.22569274902344, 96.18285369873047, 0.042821284383535385, 0.0, 1.6426764659627224e-07, 0.0, 0.0, 0.01363153662532568, 0.0, 0.04089462012052536, 0.0, 315.60052490234375, 315.4579772949219, 0.0, 127.00502014160156, 0.0, 0.0, 0.013656049966812134, 0.0, 4.136972177163251e-16, 0.0, 0.0, 0.0, 3757606.5, 3698301.5, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 442.4630126953125, 0.0, 0.0, 0.0),
 (3, 1981, 1, 11.952718734741211, 11.861368179321289, 0.09135182946920395, 0.0, 2.0325823868461157e-07, 2.0325823868461157e-07, 6.595060941805286e-09, 0.01146628800779581, 0.0, 0.03439886122941971, 0.009118038229644299, 48.2963752746582, 47.93150329589844, 0.0, 62.467620849609375, 0.0, 0.0, 0.011485105380415916, 0.0, 5.941028783295818e-14, 0.0, 0.0, 0.0, 360979.90625, 456115.90625, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 110.39912414550781, 0.009118038229644299, 0.0, 0.0),
 (4, 1981, 1, 49.48649215698242, 49.40651321411133, 0.07998340576887131, 0.0, 3.913226720442253e-08, 0.0, 0.0, 0.00722243869677186, 0.0, 0.021667316555976868, 0.0, 46.54270553588867, 46.46895217895508, 0.0, 76.61585235595703, 0.0, 0.0, 0.0072422930970788, 0.0, 1.1632789449796794e-15, 0.0, 0.0, 0.0, 1160040.75, 1899717.625, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 123.08480834960938, 0.0, 0.0, 0.0),
 (5, 1981, 1, 274.0668029785156, 272.10601806640625, 1.9608064889907837, 0.0, 2257869.75, 116675.171875, 157.49276733398438, 1408498.0, 1259125.625, 501261.6875, 416320.25, 46281.1640625, 44271.08984375, 483.65142822265625, 1362.450439453125, 23.0184326171875, 66.76303100585938, 1289.9833984375, 3866.024169921875, 26296.953125, 0.0, 54013716.0, 21046212.0, 9425129.0, 9136200.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 1304826.0, 420186.28125, 0.0, 0.0)]

## Check the number of rows

There should be 8280 rows. This can be done with the SQLite `COUNT` function. We will touch other SQLite function over the next few notebooks.

In [16]:
%sql SELECT COUNT(*) as nrow From rch

   sqlite://
 * sqlite:///demo.db3
Done.

[(8280,)]

## Use WHERE to retrieve data

- Let’s say we are interested in records for only the year 1981. Using a WHERE is pretty straightforward for a simple criterion like this.

## Example

In [131]:
%sql SELECT RCH, YR, MO, FLOW_INcms, FLOW_OUTcms From rch WHERE YR=1981 LIMIT 5

   sqlite://
 * sqlite:///demo.db3
Done.

[(1, 1981, 1, 146.34376525878906, 146.2524871826172),
 (2, 1981, 1, 96.22569274902344, 96.18285369873047),
 (3, 1981, 1, 11.952718734741211, 11.861368179321289),
 (4, 1981, 1, 49.48649215698242, 49.40651321411133),
 (5, 1981, 1, 274.0668029785156, 272.10601806640625)]

## Using *AND* to further filter data

There are 23 RCHs. We are only intersted in the 10th RCH. We can add another filter condition with an ***AND*** statement.

## Filtering with `and` and `where`

In [132]:
%sql SELECT RCH, YR, MO, FLOW_INcms, FLOW_OUTcms From rch WHERE YR=1981 AND RCH=10 LIMIT 5

   sqlite://
 * sqlite:///demo.db3
Done.

[(10, 1981, 1, 53.9464225769043, 53.8569450378418),
 (10, 1981, 2, 29.24818229675293, 29.110872268676758),
 (10, 1981, 3, 8.964656829833984, 8.776240348815918),
 (10, 1981, 4, 14.47266674041748, 14.112871170043945),
 (10, 1981, 5, 283.8179626464844, 283.138671875)]

## More combinations of filters {.smaller}

We also can further filter data with the operators of ***!=*** or ***<>*** to get data except 1981.

In [45]:
%sql SELECT RCH, YR, MO, FLOW_INcms, FLOW_OUTcms From rch WHERE YR<>1981 and RCH=10 and MO=6 LIMIT 5

   sqlite://
 * sqlite:///demo.db3
Done.

[(10, 1982, 6, 302.1027526855469, 301.51776123046875),
 (10, 1983, 6, 365.0164489746094, 364.4071350097656),
 (10, 1984, 6, 449.14593505859375, 447.8120422363281),
 (10, 1985, 6, 758.1435546875, 756.645263671875),
 (10, 1986, 6, 870.4126586914062, 869.0577392578125)]

##

In [20]:
%sql SELECT RCH, YR, MO, FLOW_INcms, FLOW_OUTcms From rch WHERE YR>2009 and RCH=10 and (MO=3 or MO=6 or MO=9 or MO=12)

   sqlite://
 * sqlite:///demo.db3
Done.

[(10, 2010, 3, 3.4298956394195557, 3.0846056938171387),
 (10, 2010, 6, 736.3016357421875, 734.9920654296875),
 (10, 2010, 9, 218.40797424316406, 218.24456787109375),
 (10, 2010, 12, 36.9558219909668, 36.877464294433594)]

##

Or we can simplify the above filter using the ***IN*** statement.

In [21]:
%sql SELECT RCH, YR, MO, FLOW_INcms, FLOW_OUTcms From rch WHERE YR>2009 and RCH=10 and MO in (3, 6, 9, 12)

   sqlite://
 * sqlite:///demo.db3
Done.

[(10, 2010, 3, 3.4298956394195557, 3.0846056938171387),
 (10, 2010, 6, 736.3016357421875, 734.9920654296875),
 (10, 2010, 9, 218.40797424316406, 218.24456787109375),
 (10, 2010, 12, 36.9558219909668, 36.877464294433594)]

## {.smaller}

Or the months are ***NOT*** in 3, 6, 9, 12

In [22]:
%sql SELECT RCH, YR, MO, FLOW_INcms, FLOW_OUTcms From rch WHERE YR>2009 and RCH=10 and MO NOT IN (3,6,9,12)

   sqlite://
 * sqlite:///demo.db3
Done.

[(10, 2010, 1, 9.619468688964844, 9.422823905944824),
 (10, 2010, 2, 6.129702091217041, 5.864690780639648),
 (10, 2010, 4, 258.67010498046875, 258.1203918457031),
 (10, 2010, 5, 1513.6510009765625, 1512.5479736328125),
 (10, 2010, 7, 583.045654296875, 582.3214721679688),
 (10, 2010, 8, 371.0841369628906, 370.7648010253906),
 (10, 2010, 10, 123.48409271240234, 123.36622619628906),
 (10, 2010, 11, 68.6158676147461, 68.5250473022461)]

## Filter with math operators {.smaller}
For example,  we could use the modulus operator (%) to filter the MOs.

In [23]:
%sql SELECT RCH, YR, MO, FLOW_INcms, FLOW_OUTcms From rch WHERE YR>2009 and RCH=10 and MO % 3 = 0

   sqlite://
 * sqlite:///demo.db3
Done.

[(10, 2010, 3, 3.4298956394195557, 3.0846056938171387),
 (10, 2010, 6, 736.3016357421875, 734.9920654296875),
 (10, 2010, 9, 218.40797424316406, 218.24456787109375),
 (10, 2010, 12, 36.9558219909668, 36.877464294433594)]

## SELECT

In [28]:
%sql SELECT * From watershed_monthly LIMIT 3

   sqlite://
 * sqlite:///demo.db3
Done.

[(1981, 1, 96.2901611328125, 0.5159813761711121, 0.4125469923019409, 6.688113689422607, 19.906705856323242, 0.0, 1854.2242431640625, 6.871741771697998, 12.269017219543457, 8.681976318359375, 0.17933471500873566, 0.00021739966177847236, 0.0022701763082295656, 1.3104768991470337, 0.0, 0.1262282431125641, 0.00011268912930972874, 0.015406808815896511, 0.0),
 (1981, 2, 160.22804260253906, 3.346802234649658, 0.6452788710594177, 9.148776054382324, 34.36812210083008, 0.0, 1766.2530517578125, 9.165532112121582, 14.773177146911621, 13.862184524536133, 1.2127171754837036, 0.0006267096032388508, 0.001955678453668952, 1.174126386642456, 0.0, 0.8965995907783508, 0.0005604379111900926, 0.10999998450279236, 0.0),
 (1981, 3, 136.6529083251953, 3.8249943256378174, 1.4813165664672852, 18.518495559692383, 34.367244720458984, 0.0, 1990.7535400390625, 13.520476341247559, 23.363500595092773, 25.018510818481445, 1.2629601955413818, 0.0008495681686326861, 0.007548550609499216, 0.5044968724250793, 0.0, 0.6799346208572388, 0.0005445934948511422, 0.08338834345340729, 0.0)]

## Calculate the difference between two columns {.smaller}

In [31]:
%%sql sqlite:///demo.db3
SELECT YR, MO,  
PREC_mm as Precipitation, 
PET_mm as PET, 
PET_mm-PREC_mm as PED 
From watershed_monthly LIMIT 10

Done.

[(1981, 1, 96.2901611328125, 12.269017219543457, -84.02114391326904),
 (1981, 2, 160.22804260253906, 14.773177146911621, -145.45486545562744),
 (1981, 3, 136.6529083251953, 23.363500595092773, -113.28940773010254),
 (1981, 4, 118.85740661621094, 36.195560455322266, -82.66184616088867),
 (1981, 5, 84.54698181152344, 89.7725601196289, 5.225578308105469),
 (1981, 6, 44.83718490600586, 123.68331909179688, 78.84613418579102),
 (1981, 7, 32.325984954833984, 174.00889587402344, 141.68291091918945),
 (1981, 8, 20.65149688720703, 152.6374969482422, 131.98600006103516),
 (1981, 9, 16.57965660095215, 115.8529052734375, 99.27324867248535),
 (1981, 10, 59.67293167114258, 43.6953010559082, -15.977630615234375)]

## MORE OPERATIONS {.smaller}

In [32]:
%%sql sqlite:///demo.db3
SELECT YR, MO,  PREC_mm as Precipitation, 
PET_mm as PET, 
(PET_mm-PREC_mm)/PREC_mm*100.0 as PED_Ratio 
From watershed_monthly LIMIT 10

Done.

[(1981, 1, 96.2901611328125, 12.269017219543457, -87.25828571143332),
 (1981, 2, 160.22804260253906, 14.773177146911621, -90.7799053730202),
 (1981, 3, 136.6529083251953, 23.363500595092773, -82.90303449708202),
 (1981, 4, 118.85740661621094, 36.195560455322266, -69.54707200351655),
 (1981, 5, 84.54698181152344, 89.7725601196289, 6.180679896716599),
 (1981, 6, 44.83718490600586, 123.68331909179688, 175.84987628255342),
 (1981, 7, 32.325984954833984, 174.00889587402344, 438.29418072534986),
 (1981, 8, 20.65149688720703, 152.6374969482422, 639.1110570914423),
 (1981, 9, 16.57965660095215, 115.8529052734375, 598.7654090904647),
 (1981, 10, 59.67293167114258, 43.6953010559082, -26.775340456351415)]

## Use math operators in a WHERE statement {.smaller}

For example, we could use the modulus operator (%) to filter the MOs.

## EXAMPLE {.smaller}

In [33]:
%%sql sqlite:///demo.db3
SELECT RCH, YR, MO, FLOW_INcms, FLOW_OUTcms 
From rch 
WHERE YR>2009 
and RCH=10 
and MO % 3 = 0

Done.

[(10, 2010, 3, 3.4298956394195557, 3.0846056938171387),
 (10, 2010, 6, 736.3016357421875, 734.9920654296875),
 (10, 2010, 9, 218.40797424316406, 218.24456787109375),
 (10, 2010, 12, 36.9558219909668, 36.877464294433594)]

## Statistics with Aggregate Functions

So far, we’ve performed math operations across columns in each row of a table. We also can calculate a result from values within the same column using aggregate function, which calculate a single result from multiple inputs. Two of the most-used aggregate functions in data analysis are avg() and sum().

## EXAMPLE

In [34]:
%%sql sqlite:///demo.db3
SELECT avg(FLOW_INcms), avg(FLOW_OUTcms) 
From rch

Done.

[(559.361707683415, 557.2792260827198)]

## SUM

sum - calculates the sum of the values in that column (omits null values).

In [35]:
%%sql 
SELECT sum(FLOW_INcms), sum(FLOW_OUTcms) 
From rch

   sqlite://
 * sqlite:///demo.db3
Done.

[(4631514.939618677, 4614271.9919649195)]

## Extreme values

max - calculates the maximum value in that column (omits null values).

min - calculates the minimum value in that column (omits null values).

In [36]:
%%sql 
SELECT min(FLOW_INcms), max(FLOW_OUTcms) 
From rch

   sqlite://
 * sqlite:///demo.db3
Done.

[(0.20121553540229797, 10499.5498046875)]

## Average Function

In [37]:
%%sql 
SELECT sum(FLOW_INcms)/COUNT(FLOW_INcms) as AVG_FlowIn, 
sum(FLOW_OUTcms)/COUNT(FLOW_OUTcms) as AVG_FlowOut
From rch

   sqlite://
 * sqlite:///demo.db3
Done.

[(559.361707683415, 557.2792260827198)]

## Aggregating data with GROUP BY and ORDER BY

- The `GROUP BY` clause is an optional clause of the SELECT statement. The GROUP BY clause a selected group of rows into summary rows by values of one or more columns. 

- The GROUP BY clause returns one row for each group. For each group, you can apply an aggregate function such as `MIN, MAX, SUM, COUNT, or AVG` to provide more information about each group.

## Check unique values

- Firstly, let's have a look at the number of RCH. 
- We can use the `DISTINCT` keyword in conjunction with SELECT statement to eliminate all the duplicate records and fetching only the unique records.

## EXAMPLE {.smaller}

In [38]:
%%sql 
SELECT COUNT(DISTINCT RCH) AS nRCH
FROM rch

   sqlite://
 * sqlite:///demo.db3
Done.

[(23,)]

We also can use the ***GROUP BY*** clause to get back a cleaner output, with fewer rows – only unique values returned.

## Use aggregate  functions on Groups

- We can get more details trough aggregating data on group than on whole columns.

## EXAMPLE

In [44]:
%%sql 
SELECT RCH
FROM rch
GROUP BY RCH LIMIT 5

   sqlite://
 * sqlite:///demo.db3
Done.

[(1,), (2,), (3,), (4,), (5,)]

## Math functions {.smaller}

In [43]:
%%sql 
SELECT RCH, AVG(FLOW_INcms), AVG(FLOW_OUTcms)
FROM rch
GROUP BY RCH LIMIT 5

   sqlite://
 * sqlite:///demo.db3
Done.

[(1, 631.8990093310674, 629.7380514648225),
 (2, 333.0202187087801, 332.79249324997267),
 (3, 152.36708157062532, 151.58638913697666),
 (4, 270.92289432916374, 270.5829954958624),
 (5, 933.1512839211358, 921.7582115385268)]

## Order/Sort Records

Firstly, let us check the years and months with the maximum FLOW_INcms

## EXAMPLE {.smaller}

In [42]:
%%sql 
SELECT RCH, YR, MO, MAX(FLOW_INcms)
FROM rch
GROUP BY RCH LIMIT 5

   sqlite://
 * sqlite:///demo.db3
Done.

[(1, 1997, 7, 3758.952392578125),
 (2, 1997, 7, 1820.2337646484375),
 (3, 1981, 5, 871.1177368164062),
 (4, 1997, 7, 1919.5400390625),
 (5, 1997, 7, 3961.945068359375)]

## ORDER BY {.smaller}

In [47]:
%%sql 
SELECT RCH, YR, MO, ROUND(MAX(FLOW_INcms),2)
FROM rch
GROUP BY RCH
ORDER BY YR, MO LIMIT 5

   sqlite://
 * sqlite:///demo.db3
Done.

[(3, 1981, 5, 871.12),
 (7, 1992, 3, 352.16),
 (6, 1992, 6, 10503.72),
 (8, 1994, 5, 7693.54),
 (9, 1994, 5, 7507.54)]

## ORDER BY AND GROUP BY

In [51]:
%%sql sqlite:///demo.db3
SELECT RCH, YR, MO, ROUND(MAX(FLOW_INcms),2)
FROM rch
GROUP BY RCH
ORDER BY YR DESC, MO LIMIT 5

Done.

[(15, 2010, 2, 445.3),
 (10, 2010, 5, 1513.65),
 (12, 2010, 5, 3167.54),
 (16, 1999, 5, 1628.88),
 (13, 1997, 6, 3291.48)]

## Filter data on groups with the HAVING clause {.smaller}

In [133]:
%%sql 
SELECT RCH, YR, MO, MAX(FLOW_INcms) as MAX_FLOWIN
FROM rch
GROUP BY RCH
HAVING MAX_FLOWIN > 3000.0
ORDER BY YR DESC, MO LIMIT 5

   sqlite://
 * sqlite:///demo.db3
Done.

[(12, 2010, 5, 3167.544921875),
 (13, 1997, 6, 3291.47900390625),
 (1, 1997, 7, 3758.952392578125),
 (5, 1997, 7, 3961.945068359375),
 (8, 1994, 5, 7693.54345703125)]

## EXAMPLE VIEW

In [55]:
%sql SELECT * From rch LIMIT 3

   sqlite://
 * sqlite:///demo.db3
Done.

[(1, 1981, 1, 146.34376525878906, 146.2524871826172, 0.09128088504076004, 0.0, 2.3320461650655488e-07, 61619.46484375, 155.3719024658203, 0.016086287796497345, 0.0, 0.04825887829065323, 0.0, 362.0486755371094, 361.8135070800781, 203.620849609375, 421.18377685546875, 0.0, 23.0184326171875, 0.016107244417071342, 0.0, 1.1839052307949238e-11, 0.0, 0.0, 0.0, 5627225.0, 5623486.5, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 806.0157470703125, 0.0, 0.0, 0.0),
 (2, 1981, 1, 96.22569274902344, 96.18285369873047, 0.042821284383535385, 0.0, 1.6426764659627224e-07, 0.0, 0.0, 0.01363153662532568, 0.0, 0.04089462012052536, 0.0, 315.60052490234375, 315.4579772949219, 0.0, 127.00502014160156, 0.0, 0.0, 0.013656049966812134, 0.0, 4.136972177163251e-16, 0.0, 0.0, 0.0, 3757606.5, 3698301.5, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 442.4630126953125, 0.0, 0.0, 0.0),
 (3, 1981, 1, 11.952718734741211, 11.861368179321289, 0.09135182946920395, 0.0, 2.0325823868461157e-07, 2.0325823868461157e-07, 6.595060941805286e-09, 0.01146628800779581, 0.0, 0.03439886122941971, 0.009118038229644299, 48.2963752746582, 47.93150329589844, 0.0, 62.467620849609375, 0.0, 0.0, 0.011485105380415916, 0.0, 5.941028783295818e-14, 0.0, 0.0, 0.0, 360979.90625, 456115.90625, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 110.39912414550781, 0.009118038229644299, 0.0, 0.0)]

## INNER JOIN

The INNER JOIN allows us to merge two tables together. But if we are going to merge tables, we need to define a commonality between the two so records from both tables line up. We need to define one or more fields they have in common and join on them.

### Check common columns

Here we take the tables of ***rch*** and ***sub*** as an example. There are three commom columns of RCH/SUB, YR and MO.

## EXAMPLE {.smaller}

In [56]:
%sql SELECT * From sub LIMIT 3

   sqlite://
 * sqlite:///demo.db3
Done.

[(1, 1981, 1, 35.60198974609375, 0.0, 3.7207436561584473, 0.24964235723018646, 10.79859447479248, 0.0, 2.3795111701474525e-05, 0.05372961238026619, 0.2988955080509186, 3.4497936191729694e-13, 2.37964208338326e-08, 2.37964208338326e-08, 2.37964208338326e-08, 2.37964208338326e-08, 4.75928416676652e-08, 0.0078118653036653996, 0.0, 1.5622873661413905e-07, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0),
 (2, 1981, 1, 108.60607147216797, 0.0, 3.4504077434539795, 0.45720556378364563, 56.32500457763672, 0.0, 1.7237898646271788e-05, 28.572050094604492, 32.59342956542969, 2.077378118700915e-13, 1.7238855676282583e-08, 1.7238855676282583e-08, 1.7238855676282583e-08, 1.7238855676282583e-08, 3.4477711352565166e-08, 0.03393149375915527, 1.6220961697399616e-05, 0.00038287980714812875, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0),
 (3, 1981, 1, 149.30836486816406, 0.0, 10.566324234008789, 6.027106285095215, 71.0020980834961, 0.0, 2.4236529498011805e-05, 3.9627554416656494, 5.274456977844238, 3.348758173971761e-13, 1.8891142872234923e-08, 1.8891142872234923e-08, 1.8891142872234923e-08, 1.8891142872234923e-08, 3.7782285744469846e-08, 0.00791492685675621, 3.7224147035885835e-06, 7.582882244605571e-05, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0)]

## Make an inner join

The syntax for the INNER JOIN in SQLite is:
>SELECT columns<br>
>FROM table1<br> 
>INNER JOIN table2<br>
>ON table1.column = table2.column;

Join on RCH/SUB, YR and MO. 

***Note***: When SELECTing the common columns, have to clearly asign a table'name. If column names or table names are too long, we can use aliases to give them short names.

## EXAMPLE {.smaller}

In [57]:
%%sql 
SELECT RCH, rch.YR, rch.MO, FLOW_INcms, FLOW_OUTcms, PRECIPmm, PETmm
FROM rch INNER JOIN sub
ON rch.RCH = sub.SUB and rch.YR=sub.YR and rch.MO=sub.MO
LIMIT 5

   sqlite://
 * sqlite:///demo.db3
Done.

[(1, 1981, 1, 146.34376525878906, 146.2524871826172, 35.60198974609375, 3.7207436561584473),
 (2, 1981, 1, 96.22569274902344, 96.18285369873047, 108.60607147216797, 3.4504077434539795),
 (3, 1981, 1, 11.952718734741211, 11.861368179321289, 149.30836486816406, 10.566324234008789),
 (4, 1981, 1, 49.48649215698242, 49.40651321411133, 108.60604858398438, 10.674993515014648),
 (5, 1981, 1, 274.0668029785156, 272.10601806640625, 201.311279296875, 27.179243087768555)]

## LEFT JOIN

Similar to the INNER JOIN clause, the LEFT JOIN clause is an optional clause of the SELECT statement. You use the LEFT JOIN clause to query data from multiple correlated tables. This type of join returns all rows from the LEFT-hand table specified in the ON condition and only those rows from the other table where the joined fields are equal (join condition is met).

The syntax for the SQLite LEFT OUTER JOIN is:
>SELECT columns<br>
>FROM table1<br>
>LEFT [OUTER] JOIN table2<br>
>ON table1.column = table2.column;

## EXAMPLE {.smaller}

In [58]:
%%sql 
SELECT RCH, rch.YR, rch.MO, FLOW_INcms, FLOW_OUTcms, PRECIPmm, PETmm
FROM rch LEFT JOIN sub
ON rch.RCH = sub.SUB and rch.YR=sub.YR and rch.MO=sub.MO
LIMIT 5

   sqlite://
 * sqlite:///demo.db3
Done.

[(1, 1981, 1, 146.34376525878906, 146.2524871826172, 35.60198974609375, 3.7207436561584473),
 (2, 1981, 1, 96.22569274902344, 96.18285369873047, 108.60607147216797, 3.4504077434539795),
 (3, 1981, 1, 11.952718734741211, 11.861368179321289, 149.30836486816406, 10.566324234008789),
 (4, 1981, 1, 49.48649215698242, 49.40651321411133, 108.60604858398438, 10.674993515014648),
 (5, 1981, 1, 274.0668029785156, 272.10601806640625, 201.311279296875, 27.179243087768555)]

## CROSS JOIN

Another type of join is called a SQLite CROSS JOIN. This type of join returns a combined result set with every row from the first table matched with every row from the second table. This is also called a Cartesian Product.

The syntax for the SQLite CROSS JOIN is:
>SELECT columns<br>
>FROM table1<br>
>CROSS JOIN table2;

## EXAMPLE {.smaller}

In [59]:
%%sql 
SELECT RCH, rch.YR, rch.MO, FLOW_INcms, FLOW_OUTcms, PRECIPmm, PETmm
FROM rch
CROSS JOIN sub
LIMIT 5

   sqlite://
 * sqlite:///demo.db3
Done.

[(1, 1981, 1, 146.34376525878906, 146.2524871826172, 35.60198974609375, 3.7207436561584473),
 (1, 1981, 1, 146.34376525878906, 146.2524871826172, 108.60607147216797, 3.4504077434539795),
 (1, 1981, 1, 146.34376525878906, 146.2524871826172, 149.30836486816406, 10.566324234008789),
 (1, 1981, 1, 146.34376525878906, 146.2524871826172, 108.60604858398438, 10.674993515014648),
 (1, 1981, 1, 146.34376525878906, 146.2524871826172, 201.311279296875, 27.179243087768555)]

## Querying Multiple Tables Using JOIN

We can use the following syntax to join multiple tables:
```SQL
SELECT columns
FROM table1
INNER JOIN table2 ON table1.column = table2.column
INNER JOIN table3 ON table1.column = table3.column
INNER JOIN tablen ON table1.column = tablen.column;
```

## Calculate Seasonal Runoff

There are two key steps:  
1. use the CASE and Subquery to convert months to named seasons;<br>
2. calculate seasonal mean with aggregate functions on groups.

In addition, we also use another filter keyword of ***BETWEEN*** to span months into seasons.

## EXAMPLE {.smaller}

In [61]:
%%sql 
SELECT RCH, Quarter, AVG(FLOW_OUTcms) as Runoff
FROM(
SELECT RCH, YR, 
CASE 
    WHEN (MO) BETWEEN 3 AND 5 THEN 'MAM'   
    WHEN (MO) BETWEEN 6 and 8 THEN 'JJA'
    WHEN (MO) BETWEEN 9 and 11 THEN 'SON'
    ELSE 'DJF' 
END Quarter,
FLOW_OUTcms
from rch)
GROUP BY RCH, Quarter LIMIT 5

   sqlite://
 * sqlite:///demo.db3
Done.

[(1, 'DJF', 99.20499053531223),
 (1, 'JJA', 1405.262297990587),
 (1, 'MAM', 559.7469320191277),
 (1, 'SON', 454.73798531426326),
 (2, 'DJF', 56.328539085388186)]

## Using Views to Simplify Queries

SQLite views are created using the CREATE VIEW statement. SQLite views can be created from a single table, multiple tables, or another view. Following is the basic [CREATE VIEW syntax](http://www.sqlitetutorial.net/sqlite-create-view/):
>CREATE [TEMP | TEMPORARY] VIEW view_name AS<br>
>SELECT column1, column2.....<br>
>FROM table_name<br>
>WHERE [condition];

- SQLite view is read only. It means you cannot use INSERT, DELETE, and UPDATE statement to update data in the base tables through the view.

## Simplifying queries with views {.smaller}

In the previous notebook, we used CASE and Subquery to calculate seasonal runoff from the table of rch. Here we use a view to simplify the calculation.

In [62]:
%%sql 
SELECT RCH, Quarter, AVG(FLOW_OUTcms) as Runoff
FROM(
SELECT RCH, YR, 
CASE 
    WHEN (MO) BETWEEN 3 AND 5 THEN 'MAM'   
    WHEN (MO) BETWEEN 6 and 8 THEN 'JJA'
    WHEN (MO) BETWEEN 9 and 11 THEN 'SON'
    ELSE 'DJF' 
END Quarter,
FLOW_OUTcms
from rch)
GROUP BY RCH, Quarter
LIMIT 5

   sqlite://
 * sqlite:///demo.db3
Done.

[(1, 'DJF', 99.20499053531223),
 (1, 'JJA', 1405.262297990587),
 (1, 'MAM', 559.7469320191277),
 (1, 'SON', 454.73798531426326),
 (2, 'DJF', 56.328539085388186)]

## Creating a view

In [63]:
%%sql 
CREATE VIEW RCH_VW AS SELECT RCH, YR, 
CASE 
    WHEN (MO) BETWEEN 3 AND 5 THEN 'MAM'   
    WHEN (MO) BETWEEN 6 and 8 THEN 'JJA'
    WHEN (MO) BETWEEN 9 and 11 THEN 'SON'
    ELSE 'DJF' 
END Quarter,
FLOW_OUTcms
from rch

   sqlite://
 * sqlite:///demo.db3
Done.

[]

## SELECT RCH_VW

In [64]:
%%sql 
SELECT * 
FROM RCH_VW 
LIMIT 5

   sqlite://
 * sqlite:///demo.db3
Done.

[(1, 1981, 'DJF', 146.2524871826172),
 (2, 1981, 'DJF', 96.18285369873047),
 (3, 1981, 'DJF', 11.861368179321289),
 (4, 1981, 'DJF', 49.40651321411133),
 (5, 1981, 'DJF', 272.10601806640625)]

## Recalculate seasonal runoffs with views

:) The codes really really get shorter.

In [65]:
%%sql 
SELECT RCH, Quarter, AVG(FLOW_OUTcms) as Runoff
FROM RCH_VW
GROUP BY RCH, Quarter
LIMIT 5

   sqlite://
 * sqlite:///demo.db3
Done.

[(1, 'DJF', 99.20499053531223),
 (1, 'JJA', 1405.262297990587),
 (1, 'MAM', 559.7469320191277),
 (1, 'SON', 454.73798531426326),
 (2, 'DJF', 56.328539085388186)]

## Deleting Views

It is quite easy to delete views. Just drop it like the following.

In [66]:
%sql DROP VIEW RCH_VW

   sqlite://
 * sqlite:///demo.db3
Done.

[]